Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv_1 (Conv1D)              (None, 998, 4)            12        
_________________________________________________________________
conv_2 (Conv1D)              (None, 997, 4)            36        
_________________________________________________________________
conv_3 (Conv1D)              (None, 996, 4)            36        
_________________________________________________________________
conv_4 (Conv1D)              (None, 995, 4)            36        
_________________________________________________________________
maxpool_1 (MaxPooling1D)     (None, 995, 4)            0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 995, 4)            0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 3980)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 4)                 15924     
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 5         
=================================================================
Total params: 16,049
Trainable params: 16,049
Non-trainable params: 0
_________________________________________________________________
