Made New Model...
With configuration:
{'DISABLE_TQDMN': False, 'VERBOSE': 0, 'LOUD_LOGGING': True, 'IS_NEW_MODEL': True, 'PATH': './Lagged_Fibonacci/', 'SEED_METHOD': 'ticks_LF', 'PRNG_METHOD': 'Lagged_Fibonacci', 'NUM_SETS': 1000, 'SET_LEN': 2000, 'BATCH_SIZE': 15, 'NUM_EPOCHS': 30, 'CHKPNT_MONITOR': 'mae', 'CHKPNT_MODE': 'min', 'USE_VALIDATION': True, 'VALIDATION_SPLIT': 0.3, 'OVERRIDE_LOAD_COMPILATION': False, 'LR': 0.001, 'LOSS_METHOD': 'mean_absolute_error'}
Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv_1 (Conv1D)              (None, 1998, 4)           12        
_________________________________________________________________
conv_2 (Conv1D)              (None, 1997, 4)           36        
_________________________________________________________________
conv_3 (Conv1D)              (None, 1996, 4)           36        
_________________________________________________________________
conv_4 (Conv1D)              (None, 1995, 4)           36        
_________________________________________________________________
maxpool_1 (MaxPooling1D)     (None, 1995, 4)           0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 1995, 4)           0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 7980)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 4)                 31924     
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 5         
=================================================================
Total params: 32,049
Trainable params: 32,049
Non-trainable params: 0
_________________________________________________________________
Pearson Correlation Coefficient:0.4984457488730327
2-tailed p-value:                6.409956464766102e-64
